enterprise/l10n_ar_edi/tests/expected_requests/FECAESolicitar-final.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:FECAESolicitar xmlns:ns0="http://ar.gov.afip.dif.FEV1/">
      <ns0:Auth>
        <ns0:Token>dummy</ns0:Token>
        <ns0:Sign>dummy</ns0:Sign>
        <ns0:Cuit>30111111118</ns0:Cuit>
      </ns0:Auth>
      <ns0:FeCAEReq>
        <ns0:FeCabReq>
          <ns0:CantReg>1</ns0:CantReg>
          <ns0:PtoVta>___ignore___</ns0:PtoVta>
          <ns0:CbteTipo>1</ns0:CbteTipo>
        </ns0:FeCabReq>
        <ns0:FeDetReq>
          <ns0:FECAEDetRequest>
            <ns0:Concepto>1</ns0:Concepto>
            <ns0:DocTipo>80</ns0:DocTipo>
            <ns0:DocNro>30714295698</ns0:DocNro>
            <ns0:CbteDesde>20</ns0:CbteDesde>
            <ns0:CbteHasta>20</ns0:CbteHasta>
            <ns0:CbteFch>___ignore___</ns0:CbteFch>
            <ns0:ImpTotal>121.00</ns0:ImpTotal>
            <ns0:ImpTotConc>0.00</ns0:ImpTotConc>
            <ns0:ImpNeto>100.00</ns0:ImpNeto>
            <ns0:ImpOpEx>0.00</ns0:ImpOpEx>
            <ns0:ImpTrib>0.00</ns0:ImpTrib>
            <ns0:ImpIVA>21.00</ns0:ImpIVA>
            <ns0:FchServDesde>False</ns0:FchServDesde>
            <ns0:FchServHasta>False</ns0:FchServHasta>
            <ns0:FchVtoPago>False</ns0:FchVtoPago>
            <ns0:MonId>PES</ns0:MonId>
            <ns0:MonCotiz>1.000000</ns0:MonCotiz>
            <ns0:CondicionIVAReceptorId>1</ns0:CondicionIVAReceptorId>
            <ns0:Iva>
              <ns0:AlicIva>
                <ns0:Id>5</ns0:Id>
                <ns0:BaseImp>100.00</ns0:BaseImp>
                <ns0:Importe>21.00</ns0:Importe>
              </ns0:AlicIva>
            </ns0:Iva>
          </ns0:FECAEDetRequest>
        </ns0:FeDetReq>
      </ns0:FeCAEReq>
    </ns0:FECAESolicitar>
  </soap-env:Body>
</soap-env:Envelope>
